Австралия/src/Catalogs/ContractForms/ContractForms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ContractForms</name>
  <predefined>
    <items>
      <name>PurchaseAndSaleContract</name>
      <description>Purchase and Sale Contract</description>
    </items>
  </predefined>
  <attributes>
    <name>Form</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>PredefinedFormTemplate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EditableParametersNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/ContractsWithCounterpartiesTemplatesParameters/ContractsWithCounterpartiesTemplatesParameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContractsWithCounterpartiesTemplatesParameters</name>
  <enumValues>
    <name>BankCompany</name>
  </enumValues>
  <enumValues>
    <name>CompanyActualAddress</name>
  </enumValues>
  <enumValues>
    <name>CompanyBankAcc</name>
  </enumValues>
  <enumValues>
    <name>CompanyBIK</name>
  </enumValues>
  <enumValues>
    <name>CompanyCounterpartyName</name>
  </enumValues>
  <enumValues>
    <name>CompanyEmailAddress</name>
  </enumValues>
  <enumValues>
    <name>CompanyFax</name>
  </enumValues>
  <enumValues>
    <name>CompanyHead</name>
  </enumValues>
  <enumValues>
    <name>CompanyHeadInitials</name>
  </enumValues>
  <enumValues>
    <name>CompanyLegalAddress</name>
  </enumValues>
  <enumValues>
    <name>CompanyName</name>
  </enumValues>
  <enumValues>
    <name>CompanyOKATO</name>
  </enumValues>
  <enumValues>
    <name>CompanyOKTMO</name>
  </enumValues>
  <enumValues>
    <name>CompanyPhone</name>
  </enumValues>
  <enumValues>
    <name>CompanyPostalAddress</name>
  </enumValues>
  <enumValues>
    <name>CompanyRNCBO</name>
  </enumValues>
  <enumValues>
    <name>CompanyTIN</name>
  </enumValues>
  <enumValues>
    <name>ContactPersonOfCounterparty</name>
  </enumValues>
  <enumValues>
    <name>ContactPersonOfCounterpartyInitials</name>
  </enumValues>
  <enumValues>
    <name>ContractNo</name>
  </enumValues>
  <enumValues>
    <name>CorrCounterpartyAccount</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyFactAddress</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyBank</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyBankAcc</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyBIK</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyEMailAddress</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyFax</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyLegalAddress</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyPhone</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyPostalAddress</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyRNCBO</name>
  </enumValues>
  <enumValues>
    <name>CounterpartyTIN</name>
  </enumValues>
  <enumValues>
    <name>Date</name>
  </enumValues>
  <enumValues>
    <name>DocumentAmount</name>
  </enumValues>
  <enumValues>
    <name>DocumentDate</name>
  </enumValues>
  <enumValues>
    <name>DocumentNumber</name>
  </enumValues>
  <enumValues>
    <name>Facsimile</name>
  </enumValues>
  <enumValues>
    <name>Logo</name>
  </enumValues>
  <enumValues>
    <name>PassportData_IssueDate</name>
  </enumValues>
  <enumValues>
    <name>PassportData_Number</name>
  </enumValues>
  <enumValues>
    <name>PassportData_ExpiryDate</name>
  </enumValues>
  <enumValues>
    <name>PassportData_Authority</name>
  </enumValues>
  <enumValues>
    <name>PositionOfContactPersonOfCounterparty</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractType</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.ShippingAddresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/ContractForms/Forms/ContractFormEditForm/Module.bsl
#Region CommonProceduresAndFunctions

&AtClient
Procedure InsertParameter(Value)
	
	BeginningBookmark = 0;
	EndBookmark = 0;
	Items.FormattedDocument.GetTextSelectionBounds(BeginningBookmark, EndBookmark);
	Try
		BeginningPosition = FormattedDocument.GetBookmarkPosition(BeginningBookmark);
		EndPosition = FormattedDocument.GetBookmarkPosition(EndBookmark);
		
		If BeginningBookmark <> EndBookmark Then 
			FormattedDocument.Delete(BeginningBookmark, EndBookmark);
			Items.FormattedDocument.SetTextSelectionBounds(BeginningBookmark, BeginningBookmark);
		EndIf;
		FormattedDocument.Insert(BeginningBookmark, Value);
		
		EndPosition = BeginningPosition + StrLen(Value);
		EndBookmark = FormattedDocument.GetPositionBookmark(EndPosition);
		Items.FormattedDocument.SetTextSelectionBounds(BeginningBookmark, EndBookmark);
		
		Modified = True;
	Except
	EndTry;
	
EndProcedure

&AtServer
Function EditableParameter()
	
	For ParameterNumber = 0 To Object.EditableParameters.Count() Do
		Presentation = "{FilledField" + (ParameterNumber + 1) + "}";
		If FormattedDocument.FindText(Presentation) <> Undefined Then
			Continue;
		EndIf;
		
		ID = "parameter" + (ParameterNumber + 1);
		If Object.EditableParameters.FindRows(New Structure("ID", ID)).Count() <> 0 Then
			Break;
		Else
			NewRow = Object.EditableParameters.Add();
			NewRow.Presentation = Presentation;
			NewRow.ID = ID;
			Break;
		EndIf;
	EndDo;
	
	Return Presentation;
	
EndFunction

&AtServer
Function InfobaseParameter(Parameter, Case = Undefined)
	
	SimilarParameters = Object.InfobaseParameters.FindRows(New Structure("Parameter", Parameter));
	For ParameterNumber = 0 To SimilarParameters.Count() Do
		
		If TypeOf(Parameter) = Type("EnumRef.ContractsWithCounterpartiesTemplatesParameters") Then
			If ParameterNumber = 0 Then
				Presentation = "{" + Parameter;
			Else
				Presentation = "{" + Parameter + (ParameterNumber + 1);
			EndIf;
		ElsIf TypeOf(Parameter) = Type("ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo") Then
			If ParameterNumber = 0 Then
				Presentation = "{" + Parameter.Description;
			Else
				Presentation = "{" + Parameter.Description + (ParameterNumber + 1);
			EndIf;
		EndIf;
		
		If FormattedDocument.FindText(Presentation) <> Undefined Then
			Continue;
		EndIf;
		
		If Case <> Undefined Then
			CasePresentation = " (" + Case + ")";
		Else
			CasePresentation = "";
		EndIf;
		
		If TypeOf(Parameter) = Type("EnumRef.ContractsWithCounterpartiesTemplatesParameters") Then
			Presentation = Presentation + CasePresentation + "}";
			ID = "infoParameter" + Parameter + (ParameterNumber + 1);
		ElsIf TypeOf(Parameter) = Type("ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo") Then
			ParameterNamePresentation = StrReplace(Parameter.Description, " ", "");
			ParameterNamePresentation = StrReplace(ParameterNamePresentation, "(", "");
			ParameterNamePresentation = StrReplace(ParameterNamePresentation, ")", "");
			
			Presentation = Presentation + "}";
			ID = "additionalParameter" + ParameterNamePresentation + (ParameterNumber + 1);
		EndIf;
			
		If Object.InfobaseParameters.FindRows(New Structure("ID", ID)).Count() <> 0 Then
			Break;
		Else
			NewRow = Object.InfobaseParameters.Add();
			NewRow.Presentation = Presentation;
			NewRow.ID = ID;
			NewRow.Parameter = Parameter;
			Break;
		EndIf;
	EndDo;
	
	Return Presentation;
	
EndFunction

&AtClient
Procedure InsertInfobaseParameter(InfobaseParameter, Case = Undefined)
	
	InsertParameter("%Parameter%");
	
	If FormattedDocument.FindText("%Parameter%") <> Undefined Then 
		
		Parameter = InfobaseParameter(InfobaseParameter, Case);
		
		BeginningBookmark = FormattedDocument.FindText("%Parameter%").BeginBookmark;
		EndBookmark = FormattedDocument.FindText("%Parameter%").EndBookmark;
		
		BeginningPosition = FormattedDocument.GetBookmarkPosition(BeginningBookmark);
		EndPosition = BeginningPosition + StrLen(Parameter);
		
		FormattedDocument.Delete(BeginningBookmark, EndBookmark);
		FormattedDocument.Insert(BeginningBookmark, Parameter);
		
		EndBookmark = FormattedDocument.GetPositionBookmark(EndPosition);
		Items.FormattedDocument.SetTextSelectionBounds(BeginningBookmark, EndBookmark);
	EndIf;
	
EndProcedure

&AtServer
Procedure RestorePredefinedFormByDefaultAtServer()
	ContractTemplate = Catalogs.ContractForms.GetTemplate(Object.PredefinedFormTemplate);
	TextHTML = ContractTemplate.GetText();
	Attachments = New Structure;
	
	EditableParameters = Object.EditableParameters.Unload();
	
	If EditableParameters.Count() <> Object.EditableParametersNumber Then 
		
		VT = New ValueTable;
		VT.Columns.Add("Presentation");
		VT.Columns.Add("ID");
		
		For Each String In EditableParameters Do 
			If String.LineNumber <= Object.EditableParametersNumber Then 
				NewRow = VT.Add();
				NewRow.Presentation = String.Presentation;
				NewRow.ID = String.ID;
			EndIf;
		EndDo;
		
		Object.EditableParameters.Load(VT);
	EndIf;
	
	Object.InfobaseParameters.Clear();
	
	Cases = New Array;
	Cases.Add(Undefined);
	Cases.Add("nominative");
	Cases.Add("genitive");
	Cases.Add("dative");
	Cases.Add("accusative");
	Cases.Add("instrumental");
	Cases.Add("prepositional");
	
	For Each ParameterEnumeration In Enums.ContractsWithCounterpartiesTemplatesParameters Do
		
		For Each Case In Cases Do
			If Case = Undefined Then
				PresentationCase = "";
			Else
				PresentationCase = " (" + Case + ")";
			EndIf;
			
			Parameter = "{" + String(ParameterEnumeration) + PresentationCase + "}";
			OccurrenceCount = StrOccurrenceCount(TextHTML, Parameter);
			For ParameterNumber = 1 To OccurrenceCount Do
				If ParameterNumber = 1 Then
					Presentation = "{" + String(ParameterEnumeration) + PresentationCase + "%deleteSymbols%" + "}";
					ID = "infoParameter" + String(ParameterEnumeration) + ParameterNumber;
				Else
					Presentation = "{" + String(ParameterEnumeration) + ParameterNumber + PresentationCase + "}";
					ID = "infoParameter" + String(ParameterEnumeration) + ParameterNumber;
				EndIf;
				
				FirstOccurence = Find(TextHTML, Parameter);
				
				TextHTML = Left(TextHTML, FirstOccurence - 1) + Presentation + Mid(TextHTML, FirstOccurence + StrLen(Parameter));
				
				NewRow = Object.InfobaseParameters.Add();
				NewRow.Presentation = StrReplace(Presentation, "%deleteSymbols%", "");
				NewRow.ID = ID;
				NewRow.Parameter = ParameterEnumeration;
				
			EndDo;
			TextHTML = StrReplace(TextHTML, "%deleteSymbols%", "");
		EndDo;
	EndDo;
	
	FormattedDocument.SetHTML(TextHTML, Attachments);
	
	Modified = True;
EndProcedure

&AtServer
Procedure AddAdditionalAttributesInsert(FormGroup, AttributesToAdd)
	
	Iterator = 0;
	For Each Attribute In AttributesToAdd Do 
		
		CommandName = "InsertAdditionalAttribute" + FormGroup.Name + Iterator;
		DescriptionAttribute = Attribute.Title;
		
		Command = Commands.Add(CommandName);
		Command.Title = DescriptionAttribute;
		Command.Action = "InsertAdditionalAttribute";
		
		Button = Items.Add(CommandName, Type("FormButton"), FormGroup);
		Button.CommandName = CommandName;
		Button.Title = DescriptionAttribute;
		
		NewRow = AdditionalAttributesVT.Add();
		NewRow.CommandName = CommandName;
		NewRow.Attribute = Attribute;
		
		Iterator = Iterator + 1;
		
	EndDo;
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	HTMLText = "";
	Attachments = New Structure;
	FormattedDocument.GetHTML(HTMLText, Attachments);
	
	FormattedDocumentStructure = New Structure;
	FormattedDocumentStructure.Insert("HTMLText", HTMLText);
	FormattedDocumentStructure.Insert("Attachments", Attachments);
	CurrentObject.Form = New ValueStorage(FormattedDocumentStructure);
	
	Iterator = 0;
	While Iterator < CurrentObject.EditableParameters.Count() Do 
		
		If Find(HTMLText, CurrentObject.EditableParameters[Iterator].Presentation) <> 0 Then 
			Iterator = Iterator + 1;
			Continue;
		EndIf;
		
		CurrentObject.EditableParameters.Delete(CurrentObject.EditableParameters[Iterator]);
		
	EndDo;
	
	Iterator = 0;
	While Iterator < CurrentObject.InfobaseParameters.Count() Do 
		
		If Find(HTMLText, CurrentObject.InfobaseParameters[Iterator].Presentation) <> 0 Then 
			Iterator = Iterator + 1;
			Continue;
		EndIf;
		
		CurrentObject.InfobaseParameters.Delete(CurrentObject.InfobaseParameters[Iterator]);
		
	EndDo;

	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	CopyingValue = Undefined;
	Parameters.Property("CopyingValue", CopyingValue);
	
	If ValueIsFilled(Object.PredefinedFormTemplate) Then 
		Items.RecallPredefinedFormDefault.Visible = True;
	Else 
		Items.RecallPredefinedFormDefault.Visible = False;
	EndIf;
	
	If ValueIsFilled(Object.Ref) Then
		If Object.Ref.Form.Get() <> Undefined Then 
			FormattedDocument.SetHTML(Object.Ref.Form.Get().HTMLText,
													Object.Ref.Form.Get().Attachments);
		EndIf;
	ElsIf ValueIsFilled(CopyingValue.Ref) Then 
		If CopyingValue.Ref.Form.Get() <> Undefined Then 
			FormattedDocument.SetHTML(CopyingValue.Ref.Form.Get().HTMLText,
													CopyingValue.Ref.Form.Get().Attachments);
		EndIf;
	Else 
		FormattedDocument = New FormattedDocument;
	EndIf;
	
	SalesOrderAdditionalAttributes = PropertyManager.GetPropertyList(Documents.SalesOrder.EmptyRef(), True, False);
	InvoiceAdditionalAttributes = PropertyManager.GetPropertyList(Documents.Quote.EmptyRef(), True, False);
	CounterpartyContractsAdditionalAttributes = PropertyManager.GetPropertyList(Catalogs.CounterpartyContracts.EmptyRef(), True, False);
	AdditionalAttributesCounterparty = PropertyManager.GetPropertyList(Catalogs.Counterparties.EmptyRef(), True, False);
	
	AddAdditionalAttributesInsert(Items.GroupAdditionalAttributesSalesOrder, SalesOrderAdditionalAttributes);
	AddAdditionalAttributesInsert(Items.GroupInvoiceAdditionalAttributes, InvoiceAdditionalAttributes);
	AddAdditionalAttributesInsert(Items.ContractSettingsGroup, CounterpartyContractsAdditionalAttributes);
	AddAdditionalAttributesInsert(Items.CounterpartySettingsGroup, AdditionalAttributesCounterparty);
	
	FormattedDocument.GetHTML(FormTextAtOpening, New Structure());
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtClient
Procedure OnClose(Exit)
	FormText = "";
	FormattedDocument.GetHTML(FormText, New Structure());
	If FormText <> FormTextAtOpening Then
		Notify("ContractTemplateChangeAndRecordAtServer", Object.Ref);
	EndIf;
EndProcedure

#EndRegion

#Region FormItemEventsHandlers

&AtClient
Procedure FormattedDocumentOnChange(Item)
	Modified = True;
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandPanelsEventsHandlers

&AtClient
Procedure InsertCounterpartyEMailAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyEMailAddress"));
EndProcedure

&AtClient
Procedure InsertCompanyEmailAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyEmailAddress"));
EndProcedure

&AtClient
Procedure InsertCounterpartyBank(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyBank"));
EndProcedure

&AtClient
Procedure InsertCompanyBank(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.BankCompany"));
EndProcedure

&AtClient
Procedure InsertContractDate(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.Date"));
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionSubjective(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "nominative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionGenitive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "genitive");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "dative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionAccusative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "accusative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionAblative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "instrumental");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionLocative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PositionOfContactPersonOfCounterparty"), "prepositional");
EndProcedure

&AtClient
Procedure InsertCounterpartyTIN(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyTIN"));
EndProcedure

&AtClient
Procedure InsertCompanyTIN(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyTIN"));
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonSubjenctive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "nominative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonGenitive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "genitive");
EndProcedure

&AtClient
Procedure InsertContactPersonOfCounterpartyDating(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "dative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonAccusative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "accusative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonAblative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "instrumental");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonLocative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterparty"), "prepositional");
EndProcedure

&AtClient
Procedure InsertCompanyName(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyName"));
EndProcedure

&AtClient
Procedure InsertCounterpartyName(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyName"));
EndProcedure

&AtClient
Procedure InsertContractNo(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContractNo"));
EndProcedure

&AtClient
Procedure InsertCompanyOKTMO(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyOKTMO"));
EndProcedure

&AtClient
Procedure InsertCompanyOKATO(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyOKATO"));
EndProcedure

&AtClient
Procedure InsertCounterpartyOKPO(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyRNCBO"));
EndProcedure

&AtClient
Procedure InsertCompanyOKPO(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyRNCBO"));
EndProcedure

&AtClient
Procedure InsertCounterpartyPostalAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyPostalAddress"));
EndProcedure

&AtClient
Procedure InsertCompanyPostalAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyPostalAddress"));
EndProcedure

&AtClient
Procedure InsertCounterpartyBankAcc(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyBankAcc"));
EndProcedure

&AtClient
Procedure InsertCompanyBankAcc(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyBankAcc"));
EndProcedure

&AtClient
Procedure InsertCounterpartyPhone(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyPhone"));
EndProcedure

&AtClient
Procedure InsertCompanyPhone(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyPhone"));
EndProcedure

&AtClient
Procedure InsertCounterpartyFax(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyFax"));
EndProcedure

&AtClient
Procedure InsertCompanyFax(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyFax"));
EndProcedure

&AtClient
Procedure InsertCounterpartyFactAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyFactAddress"));
EndProcedure

&AtClient
Procedure InsertCompanyActualAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyActualAddress"));
EndProcedure

&AtClient
Procedure InsertCounterpartyLegalAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyLegalAddress"));
EndProcedure

&AtClient
Procedure InsertCompanyLegalAddress(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyLegalAddress"));
EndProcedure

&AtClient
Procedure InsertDocumentAmount(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.DocumentAmount"));
EndProcedure

&AtClient
Procedure InsertHeadCompaniesNominative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "nominative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerGenitive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "genitive");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "dative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerAccusative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "accusative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerAblative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "instrumental");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerLocative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHead"), "prepositional");
EndProcedure

&AtClient
Procedure InsertEditableParameter(Command)
	
	InsertParameter("%Parameter%");
	
	If FormattedDocument.FindText("%Parameter%") <> Undefined Then 
		
		EditableParameter = EditableParameter();
		
		BeginningBookmark = FormattedDocument.FindText("%Parameter%").BeginBookmark;
		EndBookmark = FormattedDocument.FindText("%Parameter%").EndBookmark;
		
		BeginningPosition = FormattedDocument.GetBookmarkPosition(BeginningBookmark);
		EndPosition = BeginningPosition + StrLen("{FilledField}") + 1;
		
		FormattedDocument.Delete(BeginningBookmark, EndBookmark);
		FormattedDocument.Insert(BeginningBookmark, EditableParameter);
		
		EndBookmark = FormattedDocument.GetPositionBookmark(EndPosition);
		Items.FormattedDocument.SetTextSelectionBounds(BeginningBookmark, EndBookmark);
	EndIf;
	
EndProcedure

&AtClient
Procedure RecallPredefinedFormDefault(Command)
	RestorePredefinedFormByDefaultAtServer();
	Notify("PredefinedTemplateRestoration", Object.Ref);
EndProcedure

&AtClient
Procedure InsertCompanyBIK(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyBIK"));
EndProcedure

&AtClient
Procedure InsertCounterpartyBIK(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CounterpartyBIK"));
EndProcedure

&AtClient
Procedure InsertCounterpartyCorrespondentAccount(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CorrCounterpartyAccount"));
EndProcedure

&AtClient
Procedure InsertPassportDataIssueDate(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PassportData_IssueDate"));
EndProcedure

&AtClient
Procedure InsertPassportDataIssuingAuthority(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PassportData_Authority"));
EndProcedure

&AtClient
Procedure InsertPassportDataNumber(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PassportData_Number"));
EndProcedure

&AtClient
Procedure InsertPassportDataValidityPeriod(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.PassportData_ExpiryDate"));
EndProcedure

&AtClient
Procedure InsertFacsimile(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.Facsimile"));
EndProcedure

&AtClient
Procedure InsertPageBreak(Command)
	InsertParameter("/*PageBreak*/");
EndProcedure

&AtClient
Procedure InsertLogo(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.Logo"));
EndProcedure

&AtClient
Procedure InsertDocumentDate(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.DocumentDate"));
EndProcedure

&AtClient
Procedure InsertDocumentNumber(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.DocumentNumber"));
EndProcedure

&AtClient
Procedure InsertAdditionalAttribute(Command)
	Rows = AdditionalAttributesVT.FindRows(New Structure("CommandName", Command.Name));
	If Rows.Count() <> 0 Then
		InsertInfobaseParameter(Rows[0].Attribute);
	EndIf;
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDescriptionFullSubjective(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "nominative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDescriptionFullGenitive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "genitive");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerNameDative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "dative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDescriptionFullAccusative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "accusative");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDescriptionFullAblative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "instrumental");
EndProcedure

&AtClient
Procedure InsertCompanyTopManagerDescriptionFullLocative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.CompanyHeadInitials"), "prepositional");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullSubjective(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "nominative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullGenitive(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "genitive");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullDative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "dative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullAccusative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "accusative");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullAblative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "instrumental");
EndProcedure

&AtClient
Procedure InsertCounterpartyContactPersonPositionDescriptionFullLocative(Command)
	InsertInfobaseParameter(PredefinedValue("Enum.ContractsWithCounterpartiesTemplatesParameters.ContactPersonOfCounterpartyInitials"), "prepositional");
EndProcedure

#EndRegion
